InformationRegisters/ДоступДляЗагрузкиКандидатовИзИнтернета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ДоступДляЗагрузкиКандидатовИзИнтернета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаТокена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиДоступаДляЗагрузкиКандидатовИзИнтернета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиДоступаДляЗагрузкиКандидатовИзИнтернета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СохраняемоеЗначениеПароля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДоступДляЗагрузкиКандидатовИзИнтернета/Forms/НастройкаДоступа/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПрочитатьАдресПубликации();
	ПрочитатьТокен();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьКопированияВБуферОбмена();
	ПодключитьОбработчикОжидания("ЗаполнитьАдресПубликацииВВебКлиенте", 0.1, Истина);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийШапкиФормы

&НаКлиенте
Процедура Расширение1CHRКартинкаНажатие(Элемент)
	АдресЗагрузки = "https://v8.1c.ru/hrmcorp/dlya-hr/1c-hr-browser-extension";
	ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(АдресЗагрузки);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СкопироватьАдресПубликацииВБуферОбмена(Команда)
	СкопироватьАдресВБуферОбмена();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТокен(Команда)
	НачатьПолучениеТокена();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьАдресПубликации()
	АдресПубликацииИнформационнойБазы = Константы.АдресПубликацииИнформационнойБазыВИнтернете.Получить();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАдресПубликацииВВебКлиенте()
	
	Если Не ПустаяСтрока(АдресПубликацииИнформационнойБазы) Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиент.КлиентПодключенЧерезВебСервер() Тогда
		АдресПубликацииИнформационнойБазы = АдресПубликацииПоСтрокеСоединения(СтрокаСоединенияИнформационнойБазы());
	КонецЕсли;

	Если ПустаяСтрока(АдресПубликацииИнформационнойБазы) Тогда
		Элементы.АдресПубликацииГруппа.Видимость = Ложь;
		Элементы.АдресНезаполненПредупреждениеГруппа.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция АдресПубликацииПоСтрокеСоединения(СтрокаСоединения)
	
	ПараметрыСоединения = СтроковыеФункцииКлиентСервер.ПараметрыИзСтроки(СтрокаСоединения);
	Если ПараметрыСоединения.Свойство("WS") Тогда
		Возврат ПараметрыСоединения.WS;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьКопированияВБуферОбмена()

	Если Не ДоступнаРаботаСБуферомОбмена() Тогда
		Элементы.СкопироватьАдресПубликацииВБуферОбмена.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СкопироватьАдресВБуферОбмена()

	Если Не ДоступнаРаботаСБуферомОбмена() Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Работа с буфером обмена недоступна'"));
		Возврат;
	КонецЕсли;
	
	Попытка
		Объект = Новый COMОбъект("htmlfile");
		Объект.ParentWindow.ClipboardData.Setdata("Text", АдресПубликацииИнформационнойБазы);
		ПоказатьОповещениеПользователя(НСтр("ru = 'Успешно'"), , НСтр("ru = 'Адрес скопирован в буфер обмена'"));
	Исключение
		ВызватьИсключение НСтр("ru = 'Работа с буфером обмена недоступна'");
	КонецПопытки;

КонецПроцедуры

&НаКлиенте
Функция ДоступнаРаботаСБуферомОбмена()

	#Если Не ВебКлиент И Не МобильныйКлиент Тогда
		Возврат ОбщегоНазначенияКлиент.ЭтоWindowsКлиент();
	#КонецЕсли
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура ПрочитатьТокен()
	
	ДанныеТокена = РегистрыСведений.ДоступДляЗагрузкиКандидатовИзИнтернета.Токен();
	Если ДанныеТокена = Неопределено Тогда
		Элементы.ТокенДоступаНадпись.Заголовок = НСтр("ru = 'Токен доступа не был получен'");
		Элементы.ПолучитьТокен.Заголовок = НСтр("ru = 'Получить токен'");
		Возврат;
	КонецЕсли;
	
	Элементы.ТокенДоступаНадпись.Заголовок = 
		СтрШаблон(НСтр("ru = 'Токен доступа был получен %1'"), Формат(ДанныеТокена.ДатаТокена, "ДЛФ=DDT;"));
	Элементы.ПолучитьТокен.Заголовок = НСтр("ru = 'Получить новый токен'");
	Элементы.ПолучитьТокен.РасширеннаяПодсказка.Заголовок = НСтр("ru = 'При получении нового токена прежний аннулируется и больше не действует'");
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеТокена()
	
	Токен = НовыйПолныйТокен();
	ПоказатьТокенПользователю(Токен);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НовыйПолныйТокен()
	
	ПерсональныйТокен = НовыйПерсональныйЗаписанныйТокен();
	ДанныеАвторизации = РегистрыСведений.НастройкиДоступаДляЗагрузкиКандидатовИзИнтернета.ДанныеАвторизации();
	
	Возврат СтрСоединить(
		ОбщегоНазначенияБЗККлиентСервер.ЗначенияВМассиве(
			Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(ДанныеАвторизации.ИмяПользователя)), 
			Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(ДанныеАвторизации.Пароль)), 
			Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(ПерсональныйТокен))), 
		",");
	
КонецФункции

&НаСервереБезКонтекста
Функция НовыйПерсональныйЗаписанныйТокен()

	ПерсональныйТокен = НовыйПерсональныйТокен();
	РегистрыСведений.ДоступДляЗагрузкиКандидатовИзИнтернета.ЗаписатьТокен(ПерсональныйТокен);
	Возврат ПерсональныйТокен;

КонецФункции

&НаСервереБезКонтекста
Функция НовыйПерсональныйТокен()
	Возврат Строка(Новый УникальныйИдентификатор());
КонецФункции

&НаКлиенте
Процедура ПоказатьТокенПользователю(Токен)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Токен", Токен);
	
	ОткрытьФорму(
		"РегистрСведений.ДоступДляЗагрузкиКандидатовИзИнтернета.Форма.ТокенДоступа", 
		ПараметрыФормы, 
		ЭтотОбъект, , , , 
		Новый ОписаниеОповещения("ЗавершитьПолучениеТокена", ЭтотОбъект), 
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьПолучениеТокена(Результат, ДополнительныеПараметры) Экспорт
	ПрочитатьТокен();
КонецПроцедуры

#КонецОбласти
